package wang.biaoshu.analyzer.util;

import java.util.Collection;

import com.google.common.collect.Lists;

class TableKeys {
	final static Collection<String> keyTypeWordRegex = Lists.newArrayList("是否", "小计", "合计", "金.{0,5}?额", "名.{0,5}?称",
			"内.{0,5}?容", "公告.{0,5}日期", "地.{0,5}?址", "传.{0,5}真", "中标", "用.{0,5}途", "总.{0,5}包.{0,5}数", "预算", "名称", "序号",
			"名称", "总价", "数量", "单位", "项目", "投资额", "直径", ".{0,3}数\\s*$", "里程", "层数", "建.规模", "性质", "法人代表", "单位性质", "招标",
			"投标", "联系", "时间", "地点", "结构", "形式", "来源", "投资额", "范围", "资[格质]", "预审", "规格", "型号", "单价", "品牌", "保证金", "账号",
			"包号", "包名", "地区", "供应商", "成交", "姓名", "电话", "采购", "内容", "要求", "方式", "编号", "交货.{0,5}?期", "质保.{0,5}?期",
			"保质.{0,5}?期", "售后", "服务", "参数", "合同", "限价", "^最高", "^最低", "报价", "金额");
}
